newwms_gift/src/Reports/ит_WMS_ПланированиеНаборок/ит_WMS_ПланированиеНаборок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ит_WMS_ПланированиеНаборок</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКороба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКоробаПМУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЯчейкиРозницаНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьБутылкиПМУНаборка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаборкиРозница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

newwms_gift/src/Reports/ит_WMS_ПланированиеНаборок/Forms/ФормаОтчетаУпр/Module.bsl
&НаСервере
Процедура СохранитьНаСервере()
	СтруктураХраненияДанных=новый Структура;
	СтруктураХраненияДанных.Вставить("ДатаНачала",Отчет.ДатаНачала);
	СтруктураХраненияДанных.Вставить("ДатаОкончания",Отчет.ДатаОкончания);
	СтруктураХраненияДанных.Вставить("СтоимостьКороба",Отчет.СтоимостьКороба);
	СтруктураХраненияДанных.Вставить("СтоимостьКоробаПМУ",Отчет.СтоимостьКоробаПМУ);
	СтруктураХраненияДанных.Вставить("СтоимостьЯчейки",Отчет.СтоимостьЯчейки);
	СтруктураХраненияДанных.Вставить("СтоимостьЯчейкиРозницаНаборка",Отчет.СтоимостьЯчейкиРозницаНаборка);
	СтруктураХраненияДанных.Вставить("СтоимостьБутылкиНаборка",Отчет.СтоимостьБутылкиНаборка);
	СтруктураХраненияДанных.Вставить("СтоимостьБутылкиПМУНаборка",Отчет.СтоимостьБутылкиПМУНаборка);
	СтруктураХраненияДанных.Вставить("СтоимостьНаборки",Отчет.СтоимостьНаборки);
	СтруктураХраненияДанных.Вставить("СтоимостьНаборкиРозница",Отчет.СтоимостьНаборкиРозница);
	итWMSПривилегированныйМодуль.СохрнаитьНастройкиВХранилищеОбщихНастроек("ПланированиеНаборокWMSНастройки","ПланированиеНаборокWMSНастройки",СтруктураХраненияДанных,ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СтруктураХраненияДанных=итWMSПривилегированныйМодуль.ЗагрузитьНастройкиИзХранилищаОбщихНастроек("ПланированиеНаборокWMSНастройки","ПланированиеНаборокWMSНастройки",ПараметрыСеанса.ТекущийПользователь);
Если ТипЗнч(СтруктураХраненияДанных)=Тип("Структура")  Тогда 
		ЗаполнитьЗначенияСвойств(Отчет,СтруктураХраненияДанных);
КонецЕсли;

КонецПроцедуры
